package lesson4.Dummy;
/*
Dummy (фиктивный объект или объект-заглушка) — самый простой тип заглушки.
Это объект, который передаётся для удовлетворения конструктора. В самом
dummy-объекте ничего не будет реализовано.
Обычно такая заглушка используется для заполнения списков параметров, просто
передается тестируемой системе в качестве аргумента (или атрибута аргумента). В
большинстве случаев вместо неё можно использовать значения ‘‘null’’.
Пример использования dummy-объекта:
 */
public class PaymentService {
//    private Logger logger;
//    public PaymentService(Logger logger) {
//        this.logger = logger;
//    }
//    public booleanPaymentRequest createPaymentRequest() {
////. . .
//    }

}
